src/Reports/ПрименяемостьМатериаловВСпецификациях/ПрименяемостьМатериаловВСпецификациях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПрименяемостьМатериаловВСпецификациях</name>
</mdclass:Report>

src/Enums/СтатусыСпецификаций/СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСпецификаций</name>
  <enumValues>
    <name>Серийная</name>
  </enumValues>
  <enumValues>
    <name>Предсерийная</name>
  </enumValues>
  <enumValues>
    <name>Опытная1</name>
  </enumValues>
  <enumValues>
    <name>Опытная</name>
  </enumValues>
  <enumValues>
    <name>ОНР</name>
  </enumValues>
  <enumValues>
    <name>ДоИсчерпанияЗапасов</name>
  </enumValues>
  <enumValues>
    <name>Аналог</name>
  </enumValues>
  <enumValues>
    <name>Запрещённая</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ПрименяемостьМатериаловВСпецификациях/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ДобавитьНоменклатуру(НаименованиеТовара)
Товар = Справочники.Товары.НайтиПоНаименованию(НаименованиеТовара,Истина);
	Если Не Товар.Пустая() Тогда
		Если Не Товар.ЭтоГруппа Тогда
		СписокТоваров.Добавить(Товар);
		КонецЕсли; 
	Иначе
	Сообщить(НаименованиеТовара +" - товар не найден!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
СписокТоваров.Очистить();
Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("Выберите файл c товарами");
	Если Результат <> Неопределено Тогда
	ExcelЛист = Результат.ExcelЛист;
	КолСтрок = Результат.КоличествоСтрок;
	    Для к = 2 по КолСтрок Цикл
		Состояние("Обработка...",к*100/КолСтрок,"Загрузка товаров из файла..."); 
		ДобавитьНоменклатуру(СокрЛП(ExcelЛист.Cells(к,1).Value));
	    КонецЦикла;
	Результат.Excel.Quit();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РаскрытьНаМПЗ(ЭтапСпецификации,Товар)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Ссылка КАК Ссылка,
	|	НормыРасходов.ВидЭлемента КАК ВидЭлемента,
	|	НормыРасходов.Элемент КАК Элемент,
	|	НормыРасходовСрезПоследних.Норма КАК Норма
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Материалы))
	|	И НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНР = РезультатЗапроса.Выбрать();
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.Материалы") Тогда
		флПринадлежит = Ложь;
			Для каждого ГруппаМПЗ Из СписокМатериалов Цикл
				Если ВыборкаНР.Элемент.ПринадлежитЭлементу(ГруппаМПЗ.Значение) Тогда	
				флПринадлежит = Истина;
				КонецЕсли;					
			КонецЦикла;	
				Если  флПринадлежит Тогда
				Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ВыборкаНР.Элемент));
					Если Выборка.Количество() = 0 Тогда
					ТЧ = ТаблицаМПЗ.Добавить();
					ТЧ.ГруппаМПЗ = ПолучитьВерхнегоРодителя(ВыборкаНР.Элемент);
					ТЧ.МПЗ = ВыборкаНР.Элемент;
					ТЧ_Н = ТЧ.ТаблицаНоменклатуры.Добавить();
					ТЧ_Н.Товар = Товар;
					Иначе	
						Если Выборка[0].ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Товар",Товар)).Количество() = 0 Тогда
						ТЧ_Н = Выборка[0].ТаблицаНоменклатуры.Добавить();
						ТЧ_Н.Товар = Товар;
						КонецЕсли; 
					КонецЕсли;						
				КонецЕсли; 	
		ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(ВыборкаНР.Ссылка,ТекущаяДата(),Истина);
			Для каждого ТЧ_ТА Из ТаблицаАналогов Цикл
			флПринадлежит = Ложь;
				Для каждого ГруппаМПЗ Из СписокМатериалов Цикл
					Если ТЧ_ТА.Элемент.ПринадлежитЭлементу(ГруппаМПЗ.Значение) Тогда	
					флПринадлежит = Истина;
					КонецЕсли;					
				КонецЦикла;	
					Если флПринадлежит Тогда
					Выборка = ТаблицаМПЗ.НайтиСтроки(Новый Структура("МПЗ",ТЧ_ТА.Элемент));
						Если Выборка.Количество() = 0 Тогда
						ТЧ = ТаблицаМПЗ.Добавить();
						ТЧ.ГруппаМПЗ = ПолучитьВерхнегоРодителя(ТЧ_ТА.Элемент);
						ТЧ.МПЗ = ТЧ_ТА.Элемент;
						ТЧ_Н = ТЧ.ТаблицаНоменклатуры.Добавить();
						ТЧ_Н.Товар = Товар;
						Иначе	
							Если Выборка[0].ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Товар",Товар)).Количество() = 0 Тогда
							ТЧ_Н = Выборка[0].ТаблицаНоменклатуры.Добавить();
							ТЧ_Н.Товар = Товар;
							КонецЕсли; 
						КонецЕсли;						
					КонецЕсли;
			КонецЦикла;  					
		Иначе				
		РаскрытьНаМПЗ(ВыборкаНР.Элемент,Товар);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТаблицаМПЗ.Очистить();
ТабДок.Очистить();

Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	СтатусыМПЗСрезПоследних.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних КАК СтатусыМПЗСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Товар В ИЕРАРХИИ(&СписокТоваров)
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Товар.Наименование";
Запрос.УстановитьПараметр("СписокТоваров",СписокТоваров);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая); 
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНоменклатура = РезультатЗапроса.Выбрать();
	Пока ВыборкаНоменклатура.Следующий() Цикл
	РаскрытьНаМПЗ(ВыборкаНоменклатура.Ссылка,ВыборкаНоменклатура.Ссылка.Товар);
	КонецЦикла;
ТаблицаМПЗ.Сортировать("ГруппаМПЗ,МПЗ");
	Для каждого ТЧ Из ТаблицаМПЗ Цикл
	ОблСтрока.Параметры.НаименованиеМПЗ = СокрЛП(ТЧ.МПЗ.Наименование);
	ОблСтрока.Параметры.МПЗ = ТЧ.МПЗ;
	ОблСтрока.Параметры.Статус = ПолучитьСтатус(ТЧ.МПЗ);
	ОблСтрока.Параметры.Группа = ТЧ.ГруппаМПЗ;
	ОблСтрока.Параметры.ГруппаПоЗакупкам = ТЧ.МПЗ.ГруппаПоЗакупкам;
	ОблСтрока.Параметры.Производитель = ТЧ.МПЗ.Производитель;	
	ОблСтрока.Параметры.Цена = ОбщийМодульВызовСервера.ПолучитьСтоимостьМПЗ(ТЧ.МПЗ,1,ТекущаяДата());
	Товары = "";	
		Для каждого ТЧ_Н Из ТЧ.ТаблицаНоменклатуры Цикл
		Товары = Товары + ТЧ_Н.Товар + "; ";	
		КонецЦикла;
	ОблСтрока.Параметры.Товары = Товары;
	ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры
